Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་འགའ་ལ་ཡང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་འཚལ་བ་མ་མཆིས་སམ།
en: “Bhagavat, are there any beings who know the six-syllable vidyāmantra?”

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ནི་སུས་ཀྱང་མི་ཤེས་ཏེ། །
en: “Noble son, no one knows the six-syllable mahāvidyā.

source: འདི་ནི་རྣལ་འབྱོར་དཔག་ཏུ་མེད་པའི་ཕྱིར་བསྒྲུབ་དཀའ་བའོ། །
en: It is an inconceivable yoga and therefore difficult to obtain.

source: དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་ཀྱང་མི་མཁྱེན་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་ལྟ་ཅི་སྨོས། །
en: Even the tathāgatas do not know it, let alone the bodhisattvas.

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ནི་སུས་ཀྱང་མི་ཤེས་ཏེ།
en: “Noble son, no one knows the six-syllable mahāvidyā.

source: དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་ཀྱང་མི་མཁྱེན་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་ལྟ་ཅི་སྨོས།
en: Even the tathāgatas do not know it, let alone the bodhisattvas.

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་འདིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་བསྐལ་པ་བཅུ་དྲུག་ཏུ་ཀུན་དུ་གཤེགས་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པས་ལྟ་ཅི་སྨོས་ཏེ་ག་ལ་ཞིག་ཤེས།
en: “Noble son, all the tathāgatas have spent sixteen eons wandering in search of this six-syllable mahāvidyā, so therefore how could bodhisattvas know it?

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་སྙིང་པོ་དམ་པའོ། །
en: It is the supreme essence of Bodhisattva Mahāsattva Avalokiteśvara.

source: འགྲོ་བའི་དཀྱིལ་འཁོར་ན་ཡོངས་སུ་འཁྱམ་ཡང་སུས་ཀྱང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་སུས་ཀྱང་མི་ཤེས་སོ།
en: “If someone traveled throughout this realm of beings, there would be found a few who know the six-syllable mahāvidyā.

source: གང་ཡང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་རྟག་ཏུ་འཛིན་ཅིང་ཟློས་པ་ལ་བརྩོན་པའི་སེམས་ཅན་དེ་དག་ནི་བསོད་ནམས་དང་ལྡན་པ་ཡིན་ནོ།
en: Those beings who continually possess the six-syllable mahāvidyā and are dedicated to repeating it are meritorious.

source: དེ་དག་ཟློས་པར་བྱེད་པའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཕྲག་དགུ་བཅུ་རྩ་དགུ་འདུ་བར་འགྱུར་རོ། །
en: When they repeat it, bhagavats and buddhas to the number of sand grains in ninety-nine Ganges Rivers gather around them,

source: བྱང་ཆུབ་སེམས་དཔའ་རྡུལ་ཕྲ་རབ་དང་མཉམ་པ་དག་འདུ་བར་འགྱུར་རོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྒོ་ན་གནས་པར་འགྱུར་རོ།
en: bodhisattvas to the number of atoms gather around them, and they reach the entranceway to the six perfections.

source: གཞན་ཡང་ལྷའི་སྡེ་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་ལྷའི་བུ་དག་འདུ་བར་འགྱུར་རོ།
en: “The devas of the Trāyastriṃśa paradise also gather there.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དག་ཀྱང་ཕྱོགས་བཞི་སྲུང་བར་འགྱུར་རོ།
en: The four mahārājas guard the four directions.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་མཆིང་རྣམ་དང་། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་ལ་སོགས་ཏེ། ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་སྲུང་བར་བྱེད་དོ། །
en: Many millions of trillions of nāgas such as Nāga King Sāgara, Nāga King Anavatapta, Nāga King Takṣaka, and Nāga King Vāsuki guard the ground.

source: གཞན་ཡང་ས་བླའི་གནོད་སྦྱིན་དག་ནི་བླ་གབ་མེད་པར་སྲུང་བར་བྱེད་དོ། །
en: Also, the yakṣas from above the earth guard the open space above them.

source: རིགས་ཀྱི་བུ་དེའི་བ་སྤུའི་ཁུང་བུ་རེ་རེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་དག་བཞུགས་སོ།
en: “Ten million tathāgatas reside in each pore of that noble son.

source: བཞུགས་ནས་རིགས་ཀྱི་བུ་ཁྱོད་འདི་འདྲ་བའི་ཡིད་བཞིན་གྱི་ནོར་བུ་རྙེད་པར་བྱ་བ་ཐོབ་པར་གྱུར་ཅིང་ཁྱོད་ཀྱིས་རུས་ཀྱི་རིགས་བདུན་བརྒྱུད་དུ་ཐོབ་པར་བྱས་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་ལྟོ་ན་སྲོག་ཆགས་གནས་པ་དེ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་ཏེ་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པར་མཛད་དོ། །
en: Residing there they give their approval, saying, ‘Excellent, excellent, noble son! You have acquired such a wish-fulfilling jewel as this. Seven generations of your descendants will attain liberation. Noble son, even all the beings who live in your stomach will become irreversible bodhisattvas.

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་ལ་ལ་ཞིག་གི་ལུས་ལ་འཆང་ན་རིགས་ཀྱི་བུ་དེའི་ལུས་ནི་རྡོ་རྗེའི་ལུས་སུ་རིག་པར་བྱའོ། །
en: ‘Noble son, those who wear this six-syllable mahāvidyā on their body or on their throat will be known to have a body that is a vajra body,

source: རིང་བསྲེལ་གྱི་མཆོད་རྟེན་དུ་རིག་པར་བྱའོ། །
en: will be known to be a stūpa containing relics,

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བྱེ་བར་རིག་པར་བྱའོ། །
en: and will be known to be the wisdom of ten million tathāgatas.’

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་ཟློས་པར་བྱེད་ན་དེ་ནི་སྤོབས་པ་མི་ཟད་པར་འགྱུར་རོ། །
en: “A noble son or noble daughter who repeats the six-syllable mahāvidyā will have indestructible mental brilliance.

source: ཡེ་ཤེས་ཀྱི་ཕུང་པོ་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: He or she will become a pure mass of wisdom.

source: བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ། །
en: That person will have great love and great compassion.

source: དེ་ཉི་མ་རེ་རེ་ཞིང་ཡང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: That person will complete the six perfections each day.

source: དེ་རིག་འཛིན་གྱི་འཁོར་ལོས་སྒྱུར་བའི་དབང་ཐོབ་པར་འགྱུར་རོ། །
en: That person will receive the consecration of a vidyādhara cakravartin.

source: ལ་ལ་ཞིག་ལ་དབུགས་ཕྱིར་འབྱུང་བ་དང་ནང་དུ་རྔུབ་པར་བྱེད་ན་བྱམས་པས་ཀྱང་རུང་ཞེ་སྡང་བས་ཀྱང་རུང་སྟེ། དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: “Those who inhale that person’s breath, whether in love or in anger, will become irreversible bodhisattvas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མྱུར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: They will quickly attain the highest complete enlightenment and be samyaksaṃbuddhas.

source: ལ་ལ་ཞིག་ལག་གིས་རེག་པས་ཀྱང་རེག་པར་བྱེད་ན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པར་འགྱུར་རོ།
en: “All those who just touch that person with their clothing will become bodhisattvas in their last existence.

source: བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དག་གིས་མཐོང་བ་ཙམ་དང་།
en: “Women, men, boys, and girls who just see that person,

source: རི་དགས་དང་། བྱ་དང་། བ་ལང་དང་། བོང་བུ་ལ་སོགས་པས་ཀྱང་མཐོང་ན་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སྲིད་པ་ཐ་མ་པར་འགྱུར་རོ། །
en: and even the deer, birds, oxen, donkeys, and so on, who see that person, will all become bodhisattvas in their last existence.

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མཛའ་བ་དང་བྲལ་བའི་སྡུག་བསྔལ་མེད་པར་འགྱུར་རོ། །
en: They will not experience the suffering of birth, aging, sickness, death, and separation from the beloved.

source: རྣལ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་འགྱུར་རོ།
en: They will become inconceivable yogins.”

source: དེ་ལྟར་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་ཟློས་པར་བྱེད་ན་སྐུལ་བར་འགྱུར་རོ།
en: In that way the Bhagavat encouraged the repetition of the six-syllable mahāvidyā.

source: རྣལ་འབྱོར་བསམ་གྱིས་མི་ཁྱབ་པ་དང་བསམ་གཏན་དཔག་ཏུ་མ་མཆིས་པ་ཟིལ་གྱིས་གནོན་པར་བགྱིད་པ་
en: which is the inconceivable yoga and the immeasurable and highest dhyāna;

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མྱ་ངན་ལས་འདའ་བ་སྟོན་པར་བགྱིད་པ་
en: which shows the way to the nirvāṇa of supreme enlightenment;

source: ཐར་བར་འཇུག་པར་བགྱིད་པ།
en: which is the entranceway into liberation;

source: ཆོས་ཀྱི་མཛོད་ཡོངས་སུ་གང་བར་བགྱིད་པ།
en: which fills the treasury of the Dharma;

source: འཁོར་བ་རྩ་བ་ནས་འབྱིན་པར་བགྱིད་པ། འགྲོ་བ་ལྔ་སྐེམས་པར་བགྱིད་པ་སེམས་ཅན་དམྱལ་བ་དང་ཉོན་མོངས་པ་རྣམས་འཇོམས་པར་བགྱིད་པ་དང་།
en: which uproots saṃsāra and the five existences; which brings the hells and afflictions to an end;

source: བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པ་རྣམས་སྒྲོལ་བར་བགྱིད་པ།
en: which takes those who have become animals to a higher existence;

source: ཆོས་ཀྱི་རོ་མྱོང་བར་བགྱིད་པ། །
en: which completes the taste of the Dharma;

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་བཤད་པ་བས་མ་འཚལ་བ་
en: and which is the imperishable teaching of omniscience.

source: བདག་གིས་ཇི་ལྟར་ཐོབ་པར་བགྱི། བཅོམ་ལྡན་འདས་
en: “Bhagavat, how can I obtain it?

source: གང་བདག་ལ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་སྩོལ་བ་དེ་ལ་འཛམ་བུའི་གླིང་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་སྟེ། དབུལ་བར་འཚལ་ལོ།
en: would offer the four continents filled with the seven precious materials to anyone who bestows upon me the six-syllable mahāvidyā.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བྲིར་གྲོ་ག་དང་སྨྱུག་གུ་མ་མཆིས་ན།
en: “Bhagavat, if I cannot find a birch bark page to write it on, nor ink, nor a reed pen,

source: བདག་གི་ཁྲག་ལས་སྣག་ཚར་བགྱིས། །
en: I will make ink from my blood,

source: པགས་པ་བཤུས་ཏེ་གྲོ་གར་བགྱིས།
en: I will slice off my skin to make a page,

source: རུས་པ་བཅོམ་སྟེ་སྨྱུག་གུར་བགྱིས་ཀྱང་།
en: and I will break one of my bones to make a pen.

source: བཅོམ་ལྡན་འདས་བདག་གི་ལུས་ལ་སྐྱོ་བ་མ་མཆིས་ཏེ་དེ་ནི་ཕ་མ་དང་། བླ་མའི་ཡང་བླ་མར་འགྱུར་རོ།
en: Bhagavat, I have no concern for my body. The one who bestows it upon me will be my parents, my guru of gurus.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Bhagavat told Sarva­nīvaraṇa­viṣkambhin,

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་འདིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་རྡུལ་ཕྲ་རབ་དང་མཉམ་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་བར་ང་དྲན་ཏེ།
en: “Noble son, I remember going to as many worlds as there are atoms in the world for the sake of obtaining this six-syllable mahāvidyā.

source: དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ལ་བསྙེན་བཀུར་བྱས་པས་ཀྱང་ངས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་མ་ཐོབ་མ་ཐོས་ནས།
en: I honored many millions of trillions of tathāgatas, but I did not obtain it, and I did not hear it from those tathāgatas.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དམར་པོའི་མཆོག་ཅེས་བྱ་བ་དེའི་སྤྱན་སྔར་ངས་མཆི་མ་ཕྱུང་བ་དང་།
en: “At that time I went, weeping, to the Tathāgata, the arhat, the samyaksaṃbuddha, the one with wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tames beings, the teacher of gods and humans, the buddha, the Bhagavat Ratnottama.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་ལྟར་སྙིང་རྗེ་རྗེ་ལྟར་མཆི་མ་མ་འབྱིན་པར་
en: “The Tathāgata, the arhat, the Samyaksaṃbuddha Ratnottama said, ‘Noble son, don’t weep so pitifully.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་དམ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་པ་དེ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདི་མཁྱེན་གྱིས་སོང་ཞིག་ཅེས་བཀའ་སྩལ་ནས
en: Noble son, go to the Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama. He knows this six-syllable mahāvidyā.’

source: ་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པའི་དྲུང་དུ་སོང་ངོ་།
en: “Noble son, I went to Tathāgata Padmottama.

source: དེ་བཞིན་གཤེགས་པ་པད་མ་དམ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: I approached the realm of Tathāgata Padmottama, arrived there

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: and bowed my head to the feet of Tathāgata Padmottama.

source: སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ནས་
en: I placed my palms together before him

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་དེའི་མིང་གི་རྗེས་སུ་དྲན་པ་ཙམ་གྱིས་སྡིག་པ་ཐམས་ཅད་འབྱང་བར་འགྱུར་བ། །
en: this six-syllable mahāvidyā, which purifies all bad karma merely by the remembrance of its name.

source: བྱང་ཆུབ་སེམས་དཔའ་རྙེད་པར་དཀའ་བ་ཐོབ་པར་འགྱུར་བ་ཐོབ་པར་འཚལ་ལོ། །
en: I seek to obtain that which is difficult for a bodhisattva to obtain.

source: དེའི་སླད་དུ་བདག་འཇིག་རྟེན་གྱི་ཁམས་ཉོན་མོངས་པ་ཅན་དུ་མར་ཕྱིན་ཏེ་འདིར་མཆིས་ཀྱང་དོན་མ་མཆིས་པའི་ཚེགས་སུ་གྱུར་ཏོ། །
en: For that purpose I have been to many worlds, in distress. I have arrived here, exhausted and without any result.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་པད་མའི་མཆོག་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་འདིའི་ཡོན་ཏན་བསྔགས་པ་
en: “Then Tathāgata Padmottama praised the qualities of this six-syllable mahāvidyā:

source: དཔེར་ན་ངས་རྡུལ་ཕྲ་རབ་ཀྱི་ཚད་ནི་གཟུང་ནུས་ཀྱི།
en: As a comparison, I can know the number of atoms, but,

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ལན་ཅིག་ཟློས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་བགྲང་མི་ནུས་སོ། །
en: noble son, I cannot calculate the accumulation of merit from repeating the six-syllable mahāvidyā once.

source: རིགས་ཀྱི་བུ་རྒྱ་མཚོ་མཆིང་རྣམ་གྱི་བྱེ་མ་ནི་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: “ ‘Noble son, it is like this. As a comparison, I can count the grains of sand in the ocean, but,

source: དཔེར་ན་སྐྱེས་བུ་ལ་ལ་ཞིག་གིས་ཁྱིམ་དཔག་ཚད་བརྒྱ་ཐམ་པར་བྱས་ཏེ།
en: As a comparison, a person builds a building that is a hundred yojanas high

source: འཕང་དུ་དཔག་ཚད་ལྔ་བརྒྱར་བྱས་ལ། །
en: and five hundred yojanas wide,

source: དེ་ཏིལ་གྱི་འབྲས་བུས་ཡོངས་སུ་གང་བར་བྱེད་དེ་དེ་ན་ཁབ་ཙམ་གྱི་བུ་ག་ཡང་མེད་ལ། །
en: and completely fills it with sesame seeds. There isn’t even a needle-sized hole in this building.

source: དེའི་སྒོར་སྐྱེས་བུ་མི་རྒ་མི་འཆི་བ་ཞིག་བཞག་སྟེ།
en: At its door there is an immortal man who never ages.

source: དེས་བསྐལ་པ་བརྒྱ་འདས་ཤིང་ཏིལ་གྱི་འབྲས་བུ་གཅིག་ཕྱིར་འདོར་ཏེ། །
en: If every hundred eons that man takes out one sesame seed,

source: རྣམ་གྲངས་དེས་ཁྱིམ་གྱི་རྨང་དང་གཞི་ཡན་ཆད་ཟད་ཅིང་མེད་པར་འགྱུར་གྱི།
en: I can calculate the time when such a building would be emptied down to the floor,

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ལན་ཅིག་ཟློས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་བགྲང་མི་ནུས་སོ།
en: but, noble son, I cannot calculate the accumulation of merit that comes from repeating the six-syllable mahāvidyā once.

source: དཔེར་ན་གླིང་བཞིར་མི་རྣམས་ཀྱི་ལས་ནས་དང་། གྲོ་དང་འབྲས་དང་། རྒྱ་སྲན་དང་བལ་སྲན་ལ་སོགས་པ་དང་། རྒྱ་ཤུག་དང་། སྲན་ཆུང་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་པ་བྱས་ཏེ།
en: As a comparison, if the people in the four continents were all to work at various kinds of agriculture, such as barley, wheat, rice, green or black mung beans, and so on; and jujubes, horse gram, and so on;

source: ཀླུའི་རྒྱལ་པོས་ཀྱང་དེར་དུས་དུས་སུ་ཆར་པའི་རྒྱུན་ཕབ་ནས་འབྲུ་དེ་དག་གྲུབ་པ་དང་སྨིན་ཅིང་སྨིན་ཅིང་བརྔས་ནས་འཛམ་བུའི་གླིང་དུ་གཡུལ་གཅིག་བྱས་ལ། །
en: and the nāga kings sent rain at the appropriate times; and those grains grew, ripened, and were harvested; if Jambudvīpa were made into one threshing floor,

source: ཤིང་རྟ་དང་ཁུར་དང་བམ་པོ་དང་སྐོན་པས་བསྐྱས་ཏེ་གཡུལ་དེའི་ནང་དུ་བཅུག་ནས་བ་ལང་དང་བོང་བུ་དག་གིས་བཅགས་ཏེ་ཕུང་པོ་ཆེན་པོར་བྱས་ཀྱང་།
en: and the grain was brought in carts, in animal loads, in bundles and baskets, and put on that threshing floor, trodden by oxen and donkeys, and made into one big heap;

source: རིགས་ཀྱི་བུ་ངས་འབྲུ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: then, noble son, I could count every single grain,

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ལན་ཅིག་ཟློས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ངས་བགྲང་བར་མི་ནུས་སོ།
en: noble son, I cannot calculate the accumulation of merit that comes from repeating the six-syllable mahāvidyā once.

source: དཔེར་ན་ཆུ་བོ་ཆེན་པོ་འཛམ་བུའི་གླིང་དུ་ཉིན་མཚན་དུ་འབབ་པ་
en: As a comparison, in Jambudvīpa there are great rivers that flow day and night.

source: འདི་ལྟ་སྟེ། སི་ཏ་དང་གང་གཱ་དང་། ཡ་མུ་ན་དང་། སིན་དྷུ་དང་། པ་ཀྵུ་དང་། ཤ་ཏ་དྲུ་དང་ཙན་དྲ་བྷ་ག་དང་། ཨཻ་ར་བ་ཏི་དང་། སུ་མ་ག་ད་དང་། ཧི་མ་ཀ་ལ་དང་། ཀོ་ད་པ་རི་རྣམས་
en: They are the Sītā, the Ganges, the Yamuna, the Indus, the Pakṣu, the Sutlej, the Chenab, the Ravi, the Sumāgandha, the Himavatī, and the Godavari.

source: ཆུ་བོ་རེ་རེ་ཞིང་འཁོར་ལྔ་བརྒྱ་ལྔ་བརྒྱ་ཡོད་པ་
en: Each of these rivers has five hundred tributaries.

source: ཉིན་མཚན་དུ་རྒྱ་མཚོ་མཆིང་རྣམ་དུ་འབབ་བོ། །
en: Day and night they flow into the ocean.

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ལན་ཅིག་ཟློས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཡང་དེ་བཞིན་དུ་འཕེལ་ལོ།
en: Noble son, this is how the accumulation of merit increases as the result of a single repetition of the six-syllable mahāvidyā:

source: དེ་བས་ན་ཆུ་བོ་ཆེན་པོ་དེ་དག་ནི་ངས་ཐིགས་པ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: I can count each drop in those great rivers, but,

source: དཔེར་ན་རྐང་པ་བཞི་པའི་རིགས་བ་ལང་དང་། བོང་བུ་དང་། མ་ཧེ་དང་། རྟ་དང་། བལ་གླང་དང་། ཁྱི་དང་། ཝ་དང་། ར་དང་། ཕྱུགས་དེ་དག་དང་། དེ་བཞིན་དུ་སེང་གེ་དང་། སྟག་དང་། ཏ་རཀྵ་དང་། རི་དགས་དང་། སྤྲེའུ་དང་། རི་བོང་དང་ཕག་ལ་སོགས་པ་དང་། བྱི་བ་དང་། བྱི་ལ་ལ་སོགས་པ་དེ་དག་གི་སྤུ་ནི་ངས་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: As a comparison, I can count each hair on all four-legged beings such as herds of oxen, donkeys, buffaloes, horses, and elephants; dogs, jackals, goats, and similarly lions, tigers, wolves, deer, monkeys, hares, pigs, and so on; and rats and cats, and so on; but,

source: དཔེར་ན་རྡོ་རྗེའི་ལྕགས་ཀྱུ་ཞེས་བྱ་བའི་རིའི་རྒྱལ་པོ་འཕང་དུ་དཔག་ཚད་དགུ་ཁྲི་དགུ་སྟོང་། འོག་ཏུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་དེ། །
en: As a comparison, the king of mountains, named Vajrāṅkuśa, is 99,000 yojanas high and extends downward into the sea for 84,000 yojanas.

source: རིའི་རྒྱལ་པོ་རྡོ་རྗེའི་ལྕགས་ཀྱུ་དེའི་ངོས་རེ་རེ་ཞིང་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་ལ་
en: Vajrāṅkuśa, the king of mountains, is 84,000 yojanas wide on each side.

source: རིའི་རྒྱལ་པོ་དེའི་ངོས་ལ་སྐྱེས་བུ་མི་རྒ་མི་འཆི་བ་ཞིག་ཡོད་ནས་དེས་བསྐལ་པ་གཅིག་འདས་ཤིང་ཡུལ་ཀ་ཤི་ཀ་ནས་བྱུང་བའི་གོས་ཀྱིས་ལན་ཅིག་ཕྱིས་ཏེ།
en: On the side of that king of mountains there is an ageless, immortal man, who once every eon wipes the mountain one time with a Kaśika cloth.

source: དེ་ལྟར་བྱས་ཀྱང་དེ་ཟད་ཅིང་དེངས་པར་འགྱུར་གྱི།
en: Even this alone will eventually cause the mountain to be worn down and vanish.

source: དཔེར་ན་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་ཟབས་སུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཞེང་དུ་རྟ་རྒོད་མའི་གདོང་གི་མཐའི་བར་དུ་དཔག་ཏུ་མེད་པ་ངས་སྐྲའི་རྩེ་མོའི་བརྒྱའི་ཆས་ཐིགས་པ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: the ocean is 84,000 yojanas deep, and it has an immeasurable expanse, extending as far as Vaḍavāmukha. I can count all its drops of water, which are the size of the tip of a hair, but,

source: དཔེར་ན་ཤིང་ཤིར་ཥའི་ཚལ་གྱི་ལོ་མ་ནི་རེ་རེ་ནས་ངས་བགྲང་ནུས་ཀྱི་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ངས་བགྲང་མི་ནུས་སོ།
en: As a comparison, I can count the number of leaves in a forest of agarwood trees, but, noble son, I cannot calculate the accumulation of merit that comes from repeating the six-syllable mahāvidyā once.

source: དཔེར་ན་གླིང་ཆེན་པོ་བཞི་ན་གནས་པའི་སྐྱེས་པ་དང་བུད་མེད་དང་། ཁྱེའུ་དང་བུ་མོ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་ས་བདུན་པ་ལ་གནས་པར་གྱུར་ན།
en: As a comparison, even if all the men, women, boys, and girls who live in the four continents were to be on the seventh bodhisattva bhūmi,

source: གང་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་བས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ལན་ཅིག་བཟླས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ཤིན་ཏུ་ཆེའོ། །
en: the accumulation of merit that comes from repeating the six-syllable mahāvidyā once would be far greater than the accumulation of merit of those bodhisattvas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཟླ་བ་བཅུ་གཉིས་པའི་ལོའམ། །
en: “ ‘Noble son, it is like this. As a comparison, if for a year of twelve months,

source: ཟླ་བ་ལྷག་པ་དང་བགྲངས་པས་ཟླ་བ་བཅུ་གསུམ་གྱིས་ལོ་ཚང་བར་གྱུར་པར་ཉིན་མཚན་དུ་ཆར་པ་བབ་ན་རིགས་ཀྱི་བུ་ངས་ཐིགས་པ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི།
en: or with a leap-month to make a year of thirteen months, it were to rain day and night, noble son, I could count each drop of rain, but,

source: མང་དུ་བརྗོད་མི་དགོས་ཀྱི་ང་དང་འདྲ་བའི་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་གནས་གཅིག་ཏུ་ལྷའི་བསྐལ་པར་ན་བཟའ་དང་། བཤོས་དང་མལ་སྟན་དང་། ན་བའི་རྐྱེན་གྱི་སྨན་གྱི་ཡོ་བྱད་ཀྱིས་གནས་པར་བྱས་ཏེ། བསྙེན་བཀུར་ཐམས་ཅད་བྱས་
en: There is no need to say much, but if, for example, a million tathāgatas like me were to be in one place for an eon, provided with all requirements, with robes, food, bowls, bedding, seats, necessary medicine, and utensils,

source: ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་བགྲང་མི་ནུས་ན།
en: still those tathāgatas would not be able to calculate the accumulation of merit from the six-syllable mahāvidyā,

source: ང་གཅིག་པུ་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གནས་པས་ལྟ་ཅི་སྨོས།
en: so it is needless to say that I cannot do so all by myself in this world.

source: བསམ་གཏན་གྱི་གནས་སུ་ལྡང་བ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། རིགས་ཀྱི་བུ་ང་ནི་སྒོམ་པའི་བརྩོན་པ་ལ་བརྩོན་པར་གྱུར་པ་ཡིན།
en: “ ‘Noble son, I have entered the yoga of meditation through an inconceivable dhyāna.

source: མི་གསལ་བའི་ཆོས་མ་འོངས་པ། ཤིན་ཏུ་སྙིང་པོར་གྱུར་པའི་ཆོས་ཏེ་
en: an imperceptible Dharma, an unknown Dharma; it is the attainment of the ultimate essence.

source: ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ཡང་ཐབས་མཁས་པའོ།
en: I too obtained skillfulness in methods through the six-syllable mahāvidyā.

source: རིགས་ཀྱི་བུ་ངས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མར་འཁྱམ་ཞིང་སོང་ནས་
en: “ ‘Noble son, I also wandered through many hundreds of thousands of millions of tens of millions of worlds, and then

source: དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་ཆོས་ཀྱི་ཤུགས་ཀྱིས་མཆི་མ་བྱུང་བ་
en: in front of Tathāgata Amitābha, with palms placed together, I wept because of my emotion for the Dharma.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་པས་ད་ལྟར་དང་མ་འོངས་པ་མཁྱེན་ཏེ།
en: “ ‘At that time, Tathāgata Amitābha, who knew the present and the future,

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རིག་པའི་རྒྱལ་མོ་བསྒོམ་པའི་བརྩོན་འགྲུས་བྱ་བར་འདོད་དམ་
en: “Noble son who is united with the yoga of meditation, do you desire the six-syllable queen of mahāvidyās?”

source: བཅོམ་ལྡན་འདས་བདག་འཚལ་ལོ།
en: “I do desire it, Bhagavat;

source: བདེ་བར་གཤེགས་པ་བདག་འཚལ་ཏེ།
en: I do desire it, Sugata.

source: ཇི་ལྟར་སྐོམ་གྱིས་གདུངས་ནས་ཆབ་ཚོལ་བ་དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་བདག་ཀྱང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ཚོལ་དུ་འཇིག་རྟེན་གྱི་ཁམས་སུ་མཆིས་ཏེ།
en: I have gone to many worlds in search of the six-syllable mahāvidyā, Bhagavat, just like a thirsty person seeks water.

source: དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མ་ལ་བསྙེན་བཀུར་བགྱིས་ཀྱང་གང་ལས་ཀྱང་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རྒྱལ་མོ་མ་ཐོབ་ཀྱིས། །
en: I have attended to many millions of trillions of tathāgatas, but I have not obtained the six-syllable queen of mahāvidyās.

source: བཅོམ་ལྡན་འདས་ཁྱོད་ནི་མགོན་ནོ། །ཁྱོད་ནི་སྐྱབས་སོ། །རྟེན་ནོ།
en: Bhagavat, be my protector, refuge, and support.

source: དབང་པོ་ཉམས་པའི་ནི་མིག་ཏུ་གྱུར་ཅིག
en: Be the eyes for those whose faculties are poor.

source: ལམ་སྟོར་བའི་ནི་ལམ་དུ་གྱུར་ཅིག །
en: Be the path for those who have lost the path.

source: ཉི་མ་ཚ་བས་ཚིག་པ་རྣམས་ཀྱི་ནི་གདུགས་སུ་གྱུར་ཅིག །
en: Be a parasol for those burned by the sun.

source: ཤུལ་གྱི་བཞི་མདོ་ཆེན་པོར་ནི་ཤིང་སཱ་ལ་ཆེན་པོ་བཞིན་དུ་གྱུར་ཅིག །
en: Be like a great sal tree for a great crossroad.

source: ཆོས་ཀྱིས་ཡོངས་སུ་སྐོམ་པ་ལ་ནི་མཐའ་ཡས་པ་སྟོན་པར་གྱུར་ཅིག །
en: Be infinite teachings for those thirsty for the Dharma.

source: སེམས་ཤིན་ཏུ་བརྟན་པའི་ནི་གོ་ཆར་གྱུར་ཅིག །
en: Be armor for the complete stability of the mind.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བ་མཐའ་ཡས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་བྱ་ཀ་ལ་པིང་ཀའི་དབྱངས་ཀྱིས་བཀའ་སྩལ་པ། །
en: “ ‘Then the Tathāgata, the arhat, the Samyaksaṃbuddha Amitābha said to Bodhisattva Mahāsattva Avalokiteśvara with a voice as beautiful as a cuckoo’s song,

source: རིགས་ཀྱི་བུ་ལྟོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མའི་མཆོག་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མར་གཤེགས་ཀྱིས་རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོའི་རྒྱལ་མོ་གསོལ་ཅིག །དེ་བཞིན་གཤེགས་པར་གྱུར་བཞིན་དུ་ཀུན་དུ་གཤེགས་སོ།
en: “Noble son, look! The Tathāgata, the arhat, the Samyaksaṃbuddha Padmottama has been to many millions of trillions of worlds for the six-syllable mahāvidyā. The Tathāgata has traveled like this, noble son, so therefore give him the six-syllable queen of mahāvidyās.”

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་མེ་ཏོག་པད་མ་ལྟ་བུའི་ཕྱག་རྒྱ་འཛིན། ཇི་ལྟར་ན་ནོར་བུ་འཛིན་པའི་ཕྱག་རྒྱ་རྟོགས་པར་འགྱུར།
en: How would one apprehend the Bhagavat’s lotus-hook hand gesture? How would one know the Maṇidhara hand gesture?

source: ཇི་ལྟར་ན་རྒྱལ་པོའི་དབང་པོ་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་རྟོགས་པར་འགྱུར།
en: How would one know the lord-of-all-kings hand gesture?

source: ཇི་ལྟར་ན་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་རྟོགས་པར་འགྱུར་ཞེ་ན།
en: How would one know the correct maṇḍala?

source: དཀྱིལ་འཁོར་གྱི་མཚན་མ་ནི་འདི་ལགས་ཏེ། །
en: “ ‘ “These are the features of the maṇḍala:

source: གྲུ་བཞི་ལ་ཁྲུ་ལྔ་ཁོར་ཡུག་ཙམ་དུ་བགྱིས་ཏེ།
en: It should be square with a circumference of five cubits.

source: དཀྱིལ་འཁོར་གྱི་དབུས་སུ་ནི་སྣང་བ་མཐའ་ཡས་བྲིའོ།
en: “ ‘ “Draw Amitābha in the center of the maṇḍala.
